emacs.org
** special tex mode
#+begin_src emacs-lisp
;; preview markdown
(use-package grip-mode)

;; latex
(use-package tex
  :ensure auctex
  :straight (:type built-in)
  :config
  (setq TeX-view-program-selection '((output-pdf "PDF Tools"))
        TeX-save-query nil))
#+end_src
** books
#+begin_src emacs-lisp
;; epub
(use-package nov
  :config
  (add-to-list 'auto-mode-alist '("\\.epub\\'" . nov-mode)))

;; pdf
(use-package pdf-tools
  :pin manual ;; don't reinstall when package updates
  :magic ("%PDF" . pdf-view-mode)
  :config
  (setq-default pdf-view-display-size 'fit-page)
  (setq pdf-annot-activate-created-annotations t)
  (pdf-tools-install :no-query)
  (require 'pdf-occur)
  (setq pdf-view-use-scaling t
        pdf-view-use-imagemagick t)
  ;; revert the PDF-buffer after the TeX compilation has finished
  (add-hook 'TeX-after-compilation-finished-functions #'TeX-revert-document-buffer)
  )
#+end_src
** dictionary
you need to install the local dictionary =wordnet= (=wordnet-common= in arch). Unfortunately, this package's completing system conflicts with =ivy=..
#+begin_src emacs-lisp
(use-package wordnut)
#+end_src
* Emacs Applications
** Eshell
I disabled show completion history, since it is not very useful and it will mess up with ivy-minibuffer.
Updates Aug 7, 2021: It turns out that binding ~<tab>~ to ~company-complete~ would force to use ivy's buffer. But still, completion history would affect items showing up in company-complete menu.
Updates Aug 7, 2021: I decide to disable company-mode in eshell and use history completion.

#+begin_src emacs-lisp
(defun efs/configure-eshell ()
  ;; Save command history when commands are entered
  (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)

  ;; Truncate buffer for performance
  (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)

  ;; Use completion-at-point to provide completions in eshell
  (define-key eshell-mode-map (kbd "<tab>") 'completion-at-point)
  ;; (define-key eshell-mode-map [remap eshell-pcomplete] 'completion-at-point)
  ;; (define-key eshell-mode-map (kbd "<tab>") 'company-complete)

  (setenv "PAGER" "cat")

  (setq eshell-history-size         10000
        eshell-buffer-maximum-lines 10000
        eshell-hist-ignoredups t
        eshell-scroll-to-bottom-on-input t))

(use-package eshell-git-prompt
  :after eshell)

(use-package eshell
  :hook (eshell-first-time-mode . efs/configure-eshell)
  :config

  (with-eval-after-load 'esh-opt
    (setq eshell-destroy-buffer-when-process-dies t)
    (setq eshell-visual-commands '("htop" "zsh" "vim")))
  )

;; fish completion
(use-package fish-completion
  :hook (eshell-mode . fish-completion-mode))

;; show complete history
(use-package esh-autosuggest
  ;; :disabled
  :hook (eshell-mode . esh-autosuggest-mode)
  :config
  (setq esh-autosuggest-delay 0.5)
  (set-face-foreground 'company-preview-common "#4b5668")
  (set-face-background 'company-preview nil)
  )

;; command highlight
(use-package eshell-syntax-highlighting
  :after esh-mode
  :config
  (eshell-syntax-highlighting-global-mode +1))

(use-package eshell-info-banner
  :disabled
  :straight (eshell-info-banner :type git
                                :host github
                                :repo "phundrak/eshell-info-banner.el")
  :hook (eshell-banner-load . eshell-info-banner-update-banner)
  )

;; themes
(use-package eshell-prompt-extras
  :after esh-mode
  :config
  (with-eval-after-load "esh-opt"
    (autoload 'epe-theme-lambda "eshell-prompt-extras")
    (setq eshell-highlight-prompt t     ; damn! this means ineditable prompt!
          eshell-prompt-function 'epe-theme-lambda))
  )
#+end_src

open an eshell from 
#+begin_src emacs-lisp
(defun zw/show-eshell()
  (interactive)
  ;; (select-window (split-window-vertically -15))
  (eshell)
  ;; (text-scale-set 0.7)
  )
#+end_src
* Desktop (EXWM)
This part is largely copied from daviwil's course.

#+begin_src emacs-lisp
(when (eq system-type 'gnu/linux)
  (org-babel-load-file "~/.emacs.d/emacs-desktop.org"))
#+end_src
* Development
#+begin_src emacs-lisp
(when (eq system-type 'gnu/linux)
  (org-babel-load-file "~/.emacs.d/emacs-development.org"))
#+end_src
* System
#+begin_src emacs-lisp
(when (eq system-type 'gnu/linux)
  (org-babel-load-file "~/.emacs.d/emacs-system.org"))
#+end_src
* Key-bindings

key bindings in minibuffer will over the ones in major buffer. For example, in EXWM I defined ~s-<tab>~ to be ~switch-to-buffer~. Then, in the ivy's minibuffer, I overwrite ~s-<tab>~ to be navigate through the items in ivy.

My key binding strategy:
+ super key is used for exwm/frame/window/buffer level commands
+ super key is also used for some MacOS keys
+ ctrl key is used for tab level commands
+ ctrl+x prefix is used for emacs' default commands
+ ctrl+c prefix is used for custom commands

#+begin_src emacs-lisp
;; Make ESC quit prompts
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)
;; undo
(global-set-key (kbd "s-z") 'undo)
;; cut copy paste
(global-set-key (kbd "s-x") 'kill-region)
(global-set-key (kbd "s-c") 'kill-ring-save)
(global-set-key (kbd "s-v") 'yank)
;; window
(global-set-key (kbd "s-w") 'delete-window)
(global-set-key (kbd "s-t") 'split-window-sensibly-prefer-horizontal)

;; check dict
(global-set-key (kbd "C-c w") 'wordnut-search)
(global-set-key (kbd "C-c W") 'wordnut-lookup-current-word)

;; toggle transparency
(global-set-key (kbd "C-c t") 'toggle-transparency)
#+end_src
